app/controllers/home_controller.rb

  def index

    @cats = Item.all
---
SELECT  "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def show


    @cat = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]